ITHACA-FV/tutorials/CFD/vortexMergerWPsi_ITHACA/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesWout 50;
NmodesWproj 10;

NmodesPsi_zout 50;
NmodesPsi_zproj 8;

/* NmodesSUPout 50;
NmodesSUPproj 10; */

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;
